Repository: nh36/ChinTransMem
Catalog: corpus/candidates/liji/exports/tmx/liji__liji-018-record-on-the-subject-of-education__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 發慮憲，求善良，足以謏聞，不足以動眾；就賢體遠，足以動眾，未足以化民。君子如欲化民成俗，其必由學乎！
en: When a ruler is concerned that his measures should be in accordance with law, and seeks for the (assistance of the) good and upright, this is sufficient to secure him a considerable reputation, but not to move the multitudes. When he cultivates the society of the worthy, and tries to embody the views of those who are remote (from the court), this is sufficient to move the multitudes, but not to transform the people. If he wish to transform the people and to perfect their manners and customs, must he not start from the lessons of the school? The jade uncut will not form a vessel for use

source: 玉不琢，不成器；人不學，不知道。是故古之王者建國君民，教學為先。《兌命》曰：
en: and if men do not learn, they do not know the way (in which they should go). On this account the ancient kings, when establishing states and governing the people, made instruction and schools a primary object as it is said in the Charge to Yue, 'The thoughts from first to last should be fixed on learning.' However fine the viands be, if one do not eat, he does not know their taste

source: 「念終始典于學。」其此之謂乎！雖有嘉肴，弗食，不知其旨也；雖有至道，弗學，不知其善也。
en: however perfect the course may be, if one do not learn it, be does not know its goodness. Therefore when he learns, one knows his own deficiencies when he teaches, he knows the difficulties of learning. After he knows his deficiencies, one is able to turn round and examine himself

source: 故學然後知不足，教然後知困。知不足，然後能自反也；知困，然後能自強也，故曰：教學相長也。
en: after he knows the difficulties, he is able to stimulate himself to effort. Hence it is said, 'Teaching and learning help each other;' as it is said in the Charge to Yueh, 'Teaching is the half of learning.' According to the system of ancient teaching, for the families of (a hamlet) there was the village school for a neighbourhood there was the xiang

source: 《兌命》曰：「學學半。」其此之謂乎！古之教者，家有塾，黨有庠，術有序，國有學。
en: for the larger districts there was the xu and in the capitals there was the college. Every year some entered the college, and every second year there was a comparative examination. In the first year it was seen whether they could read the texts intelligently, and what was the meaning of each

source: 比年入學，中年考校。一年視離經辨志，三年視敬業樂群，五年視博習親師，七年視論學取友，謂之小成；
en: in the third year, whether they were reverently attentive to their work, and what companionship was most pleasant to them in the fifth year, how they extended their studies and sought the company of their teachers in the seventh year, how they could discuss the subjects of their studies and select their friends. They were now said to have made some small attainments.

source: 九年知類通達，強立而不反，謂之大成。夫然後足以化民易俗，近者說服，而遠者懷之，此大學之道也。《記》曰：
en: In the ninth year, when they knew the different classes of subjects and had gained a general intelligence, were firmly established and would not fall back, they were said to have made grand attainments. After this the training was sufficient to transform the people, and to change (anything bad in) manners and customs. Those who lived near at hand submitted with delight, and those who were far off thought (of the teaching) with longing desire. Such was the method of the Great learning

source: 「蛾子時術之。」其此之謂乎！大學始教，皮弁祭菜，示敬道也；《宵雅》肄三，官其始也；
en: as is said in the Record, 'The little ant continually exercises the art (of amassing).' At the commencement of the teaching in the Great college, (the masters) in their skin caps presented the offerings of vegetables (to the ancient sages), to show their pupils the principle of reverence for them and made them sing (at the same time) the (first) three pieces of the Minor Odes of the Kingdom, as their first lesson in the duties of officers. When they entered the college, the drum was beaten and the satchels were produced, that they might begin their work reverently.

source: 入學鼓篋，孫其業也；夏楚二物，收其威也；未卜禘不視學，游其志也；時觀而弗語，存其心也；
en: The cane and the thorns were there to secure in them a proper awe. It was not till the time for the summer sacrifice was divined for, that the testing examination was held;--to give composure to their minds. They were continually under inspection, but not spoken to,--to keep their minds undisturbed. They listened, but they did not ask questions

source: 幼者聽而弗問，學不躐等也。此七者，教之大倫也。《記》曰：「凡學官先事，士先志。
en: and they could not transgress the order of study (imposed on them). These seven things were the chief regulations in the teaching. As it is expressed in the Record, 'In all learning, for him who would in be an officer the first thing is (the knowledge of) business for scholars the first thing is the directing of the mind.'

source: 」其此之謂乎！大學之教也時，教必有正業，退息必有居。學，不學操縵，不能安弦；不學博依，不能安《詩》；
en: In the system of teaching at the Great college, every season had its appropriate subject and when the pupils withdrew, and gave up their lessons (for the day), they were required to continue their study at home. If a student do not learn (at college) to play in tune, he cannot quietly enjoy his lutes if he do not learn extensively the figures of poetry, he cannot quietly enjoy the odes

source: 不學雜服，不能安禮；不興其藝，不能樂學。故君子之於學也，藏焉，修焉，息焉，游焉。夫然，故安其學而親其師，樂其友而信其道。
en: if he do not learn the varieties of dress, he cannot quietly take part in the different ceremonies if he do not acquire the various accomplishments, he cannot take delight in learning. Therefore a student of talents and virtue pursues his studies, withdrawn in college from all besides, and devoted to their cultivation, or occupied with them when retired from it, and enjoying himself. Having attained to this, he rests quietly in his studies and seeks the company of his teachers

source: 是以雖離師輔而不反也。《兌命》曰：「敬孫務時敏，厥修乃來。
en: he finds pleasure in his friends, and has all confidence in their course.

source: 」其此之謂乎！今之教者，呻其占畢，多其訊，言及于數，進而不顧其安，使人不由其誠，教人不盡其材；
en: Although he should be separated from his teachers and helpers, he will not act contrary to the course as it is said in the Charge to Yueh, 'Maintain a reverent humility, and strive to be constantly earnest. In such a case the cultivation will surely come.' According to the system of teaching now-a-days, (the masters) hum over the tablets which they see before them, multiplying their questions.

source: 其施之也悖，其求之也佛。夫然，故隱其學而疾其師，苦其難而不知其益也，雖終其業，其去之必速。
en: They speak of the learners' making rapid advances, and pay no regard to their reposing (in what they have acquired). In what they lay on their learners they are not sincere, nor do they put forth all their ability in teaching them. What they inculcate is contrary to what is right, and the learners are disappointed in what they seek for. In such a case, the latter are distressed by their studies and hate their masters

source: 教之不刑，其此之由乎！大學之法，禁於未發之謂豫，當其可之謂時，不陵節而施之謂孫，相觀而善之謂摩。
en: they are embittered by the difficulties, and do not find any advantage from their (labour). They may seem to finish their work, but they quickly give up its lessons. That no results are seen from their instructions:-is it not owing to these defects? The rules aimed at in the Great college were the prevention of evil before it was manifested

source: 此四者，教之所由興也。發然後禁，則捍格而不勝；
en: the timeliness of instruction just when it was required the suitability of the lessons in adaptation to circumstances and the good influence of example to parties observing one another. It was from these four things that the teaching was so effectual and flourishing.

source: 時過然後學，則勤苦而難成；雜施而不孫，則壞亂而不修；獨學而無友，則孤陋而寡聞；燕朋逆其師；
en: Prohibition of evil after it has been manifested meets with opposition, and is not successful. Instruction given after the time for it is past is done with toil, and carried out with difficulty. The communication of lessons in an undiscriminating manner and without suitability produces injury and disorder, and fails in its object.

source: 燕辟廢其學。此六者，教之所由廢也。君子既知教之所由興，又知教之所由廢，然後可以為人師也。
en: Learning alone and without friends makes one feel solitary and uncultivated, with but little information. Friendships of festivity lead to opposition to one's master. Friendships with the dissolute lead to the neglect of one's learning. These six things all tend to make teaching vain.

source: 故君子之教喻也，道而弗牽，強而弗抑，開而弗達。道而弗牽則和，強而弗抑則易，開而弗達則思；
en: When a superior man knows the causes which make instruction successful, and those which make it of no effect, he can become a teacher of others. Thus in his teaching, he leads and does not drag he strengthens and does not discourage he opens the way but does not conduct to the end (without the learner's own efforts).

source: 和易以思，可謂善喻矣。
en: Leading and not dragging produces harmony.

source: 學者有四失，教者必知之。
en: Strengthening and not discouraging makes attainment easy.

source: 人之學也，或失則多，或失則寡，或失則易，或失則止。此四者，心之莫同也。
en: Opening the way and not conducting to the end makes (the learner) thoughtful. He who produces such harmony, easy attainment, and thoughtfulness may be pronounced a skilful teacher. Among learners there are four defects with which the teacher must make himself acquainted. Some err in the multitude of their studies some, in their fewness

source: 知其心，然後能救其失也。教也者，長善而救其失者也。
en: some, in the feeling of ease (with which they proceed)

source: 善歌者，使人繼其聲；善教者，使人繼其志。
en: and some, in the readiness with which they stop.

source: 其言也約而達，微而臧，罕譬而喻，可謂繼志矣。君子知至學之難易，而知其美惡，然後能博喻；
en: These four defects arise from the difference of their minds. When a teacher knows the character of his mind, he can save the learner from the defect to which he is liable. Teaching should be directed to develop that in which the pupil excels, and correct the defects to which he is prone. The good singer makes men (able) to continue his notes, and (so) the good teacher makes them able to carry out his ideas.

source: 能博喻然後能為師；能為師然後能為長；
en: His words are brief, but far-reaching unpretentious, but deep

source: 能為長然後能為君。
en: with few illustrations, but instructive.

source: 故師也者，所以學為君也。是故擇師不可不慎也。
en: In this way he may be said to perpetuate his ideas.

source: 《記》曰：「三王四代唯其師。」此之謂乎！凡學之道，嚴師為難。
en: When a man of talents and virtue knows the difficulty (on the one hand) and the facility (on the other) in the attainment of learning, and knows (also) the good and the bad qualities (of his pupils), he can vary his methods of teaching. When he can vary his methods of teaching, he can be a master indeed. When he can be a teacher indeed, he can be the Head (of an official department). When he can be such a Head, he can be the Ruler (of a state).

source: 師嚴然後道尊，道尊然後民知敬學。是故君之所不臣於其臣者二：
en: Hence it is from the teacher indeed, that one learns to be a ruler, and the choice of a teacher demands the greatest care as it is said in the Record, 'The three kings and the four dynasties were what they were by their teachers.' In pursuing the course of learning, the difficulty is in securing the proper reverence for the master. When that is done, the course (which he inculcates) is regarded with honour.

source: 當其為尸則弗臣也，當其為師則弗臣也。
en: When that is done, the people know how to respect learning.

source: 大學之禮，雖詔於天子，無北面；所以尊師也。善學者，師逸而功倍，又從而庸之；
en: Thus it is that there are two among his subjects whom the ruler does not treat as subjects. When one is personating (his ancestor), he does not treat him as such, nor does he treat his master as such. According to the rules of the Great college, the master, though communicating anything to the son of Heaven, did not stand with his face to the north. This was the way in which honour was done to him.

source: 不善學者，師勤而功半，又從而怨之。善問者，如攻堅木，先其易者，後其節目，及其久也，相說以解；
en: The skilful learner, while the master seems indifferent, yet makes double the attainments of another, and in the sequel ascribes the merit (to the master). The unskilful learner, while the master is diligent with him, yet makes (only) half the attainments (of the former), and in the sequel is dissatisfied with the master. The skilful questioner is like a workman addressing himself to deal with a hard tree. First he attacks the easy parts, and then the knotty.

source: 不善問者反此。善待問者，如撞鐘，叩之以小者則小鳴，叩之以大者則大鳴，待其從容，然後盡其聲；
en: After a long time, the pupil and master talk together, and the subject is explained. The unskilful questioner takes the opposite course. The master who skilfully waits to be questioned, may be compared to a bell when it is struck. Struck with a small hammer, it gives a small sound.

source: 不善答問者反此。此皆進學之道也。
en: Struck with a great one, it gives a great sound.

source: 記問之學，不足以為人師。必也聽語乎，力不能問，然後語之；語之而不知，雖舍之可也。
en: But let it be struck leisurely and properly, and it gives out all the sound of which it is capable. He who is not skilful in replying to questions is the opposite of this. This all describes the method of making progress in learning. He who gives (only) the learning supplied by his memory in conversations is not fit to be a master.

source: 良冶之子，必學為裘；良弓之子，必學為箕；始駕者反之，車在馬前。君子察於此三者，可以有志於學矣。
en: Is it not necessary that he should hear the questions (of his pupils)? Yes, but if they are not able to put questions, he should put subjects before them. If he do so, and then they do not show any knowledge of the subjects, he may let them alone. The son of a good founder is sure to learn how to make a fur-robe.

source: 古之學者：比物醜類。鼓無當於五聲，五聲弗得不和。水無當於五色，五色弗得不章。
en: The son of a good maker of bows is sure to learn how to make a sieve. Those who first yoke a (young) horse place it behind, with the carriage going on in front of it. The superior man who examines these cases can by them instruct himself in (the method of) learning. The ancients in prosecuting their learning compared different' things and traced the analogies between them.

source: 學無當於五官。五官弗得不治。師無當於五服，五服弗得不親。君子曰：
en: The drum has no special relation to any of the musical notes but without it they cannot be harmonised. Water has no particular relation to any of the five colours but without it they cannot be displayed.

source: 大德不官，大道不器，大信不約，大時不齊。
en: Learning has no particular relation to any of the five senses but without it they cannot be regulated. A teacher has no special relation to the five degrees of mourning but without his help they cannot be worn as they ought to be.

source: 察於此四者，可以有志於學矣。三王之祭川也，皆先河而後海；或源也，或委也。此之謂務本。
en: A wise man has said, 'The Great virtue need not be confined to one office Great power of method need not be restricted to the production of one article Great truth need not be limited to the confirmation of oaths Great seasonableness accomplishes all things, and each in its proper time.' By examining these four cases, we are taught to direct our aims to what is fundamental.
